#В городском парке живут соловьи. Однако, их редко слышно, потому что они поют только когда температура 
#на улице от 22 до 30 градусов в любое время года. Летом они поют при температуре от 15 до 35 градусов.

#Напишите программу, которая определяет, поют в данный момент соловьи или нет.

#Текущую температуру и время года программа должна брать из аргументов командной строки. А если их не передали — спрашивать у пользователя.

temperature = ARGV[0]

season = ARGV[1]

if temperature == nil and season == nil
    p "Яка зараз температура повітряя?" 
    temperature = STDIN.gets.to_i
    p "Яка зараз пора року? (0 - весна, 1 - літо, 2 - осінь, 3 - зима)"
    season = STDIN.gets.to_i
    if  season == 1 
        if temperature >= 15 && temperature <= 35
            p "Швидше, в парк, солов'ї співають!"
        else
            p "Зараз солов'ї мовчать, гріються чи розважаються :)" 
        end
    else    
        if temperature >= 22 && temperature <= 30
            p  "Швидше, в парк, солов'ї співають!"
        else
            p "Зараз солов'ї мовчать, гріються чи розважаються :)"
        end         
    end
else     
    if  season == 1 
        if temperature >= 15 && temperature <= 35
            p "Зараз солов'ї мовчать, гріються чи розважаються :)" 
        else
            p "Швидше, в парк, солов'ї співають!"
        end
    else    
        if temperature >= 22 && temperature <= 30
            p "Зараз солов'ї мовчать, гріються чи розважаються :)" 
        else
            p "Швидше, в парк, солов'ї співають!"
        end         
    end
end

