# Модифицируйте конвертер валют так, чтобы сначала он спрашивал у пользователя направление конвертации.

puts "Яка у вас валюта? 
1. Долари
2. Гривні" 

v = gets.to_f

if v == 2

    puts "Скільки зараз коштує 1 долар у гривнях?"

    dol = gets.to_f

    puts "Скільки у вас гривень?"

    uan = gets.to_f

    zd = (uan/dol).round(2)

    puts "Ваші запаси становлять" + zd.to_s + "$"

else

    puts "Скільки зараз коштує 1 долар у гривнях?"

    dol = gets.to_f

    puts "Скільки у вас доларів?"

    d = gets.to_f

    zh = (dol*d).round(2)

    puts "Ваші запаси становлять" + zh.to_s + "₴"

end   

