#Вспомните программу, где нужно за 3 попытки угадать число от 0 до 16, загаданное компьютером.

#Теперь когда вы знакомы с методами — перепишите программу так, чтобы не повторять три раза одну и ту же конструкцию if, вместо нее нужно три раза вызвать один метод.

puts "Загадали число від 0 до 15 включно. Потрібно вгадати яке"

m = rand(16)

n = gets.to_i

def comparison(a, b)

    if (a == b)  

        puts "Ура! Ви перемогли!" 

        exit

    end

    if (a - b).abs <= 2 

        if (a - b) < 0

            puts "Тепло (потрібно менше)"

        else
    
            puts "Тепло (потрібно більше)"

        end

    end

    if (a - b).abs >= 3 

        if (a - b) < 0 
        
            puts "Холодно (потрібно менше)"

        else 
        
            puts "Холодно (потрібно більше)"

        end

    end   

end

comparison(m, n)

c = gets.to_i

comparison(m, c)

d = gets.to_i

if (m == d)  

    puts "Ура! Ви перемогли!" 

    exit

else 

    puts "Ви не змогли вгадати. Це було число " + m.to_s  

end
