#Объявите в программе два разных массива строк: один, состоящий из нескольких мужских имен, другой — из женских.

#Как угодно создайте третий массив так, чтобы он состоял из всех элементов первого и второго массивов (т. е. из всех мужских и женских имен), не повторяя эти имена в коде. То есть, используя элементы из первых двух массивов.

#Потом выведите все три массива на экран.

men = ["Oleg", "Vasyl", "Igor"]

women = ["Sasha", "Anna", "Nadia"]

names = men + women

puts "Жіночі імена: " + men.to_s

puts "Чоловічі імена: " + women.to_s

puts "Усі імена: " + names.to_s
